<template>
  <div class="thankyou">
    Спасибо за оформление полиса с "Прополис"!
После оформления заявки на сайте специалист подготовит полис и свяжется с вами для уточнения деталей и согласования 
проекта полиса. После согласования проекта вам придет счёт на оплату от страховой компании. После оплаты вы получите 
чек и оригинал полиса, который нужно подписать и отправить нам по адресу 
<a href="mailto:info@propolis.ru">info@propolis.ru</a> либо в <a href="https://wa.me/79967917901">ватсап</a>. Чек и оригинал 
полиса необходимо направить в ваш банк.
  </div>
</template>

<script>
export default {
  name: 'ThankyouBig'
}
</script>

<style>

</style>